app/controllers/votes_controller.rb

  def index
    @votes = Vote.all
---
SELECT "votes".* FROM "votes"

  def create
    @vote = Vote.new(vote_params)
    # unless Topic.all.all? { |topic| params[:v].include? topic.id.to_s }
    #   render text: 'Please select all'
    #   return
    # end
    respond_to do |format|
      if @vote.save
        Topic.all.each do |topic|
          project_id = params[:v][topic.id.to_s]
          topic_id = topic.id
          vote_id = @vote.id
          VoteItem.create(topic_id: topic_id, vote_id: vote_id, project_id: project_id.to_i)
---
INSERT INTO "votes" ("created_at", "student_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-07 08:25:59.894272"], ["student_id", "kpwifjowilfe"], ["updated_at", "2014-06-07 08:25:59.894272"]]
SELECT "topics".* FROM "topics"
INSERT INTO "vote_items" ("created_at", "project_id", "topic_id", "updated_at", "vote_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-07 08:25:59.904545"], ["project_id", 3], ["topic_id", 1], ["updated_at", "2014-06-07 08:25:59.904545"], ["vote_id", 1]]

    def set_vote
      @vote = Vote.find(params[:id])
---
SELECT  "votes".* FROM "votes"  WHERE "votes"."id" = ? LIMIT 1  [["id", 1]]