app/views/votes/_form.html.erb


    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"


      <% category.topics.each do |topic |%>
---
SELECT "topics".* FROM "topics"  WHERE "topics"."category_id" = ?  [["category_id", 1]]

        <h3><%= topic.name %></h3>
        <% category.projects.each do |project|%>
---
SELECT "projects".* FROM "projects"  WHERE "projects"."category_id" = ?  [["category_id", 1]]