app/views/votes/index.html.erb

SELECT "votes".* FROM "votes"
---
        <td><%= vote.student_id %></td>
        <% all_votes += vote.vote_items.count %>