app/views/votes/new.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="field">
      <% Category.all.each do |category| %>

SELECT "topics".* FROM "topics"  WHERE "topics"."category_id" = ?  [["category_id", 1]]
---
        <div class="topic-container">
        <% category.topics.each do |topic| %>

SELECT "projects".* FROM "projects"  WHERE "projects"."category_id" = ?  [["category_id", 1]]
---
              <h3><%= topic.name %></h3>
              <% category.projects.each do |project| %>